Autodesk.Revit.DB.Mechanical.SystemZoneElementType.CreateSpaceBased(Autodesk.Revit.DB.Document,System.String)
Creates a new element type for space-based system-zone elements and adds it to the document.
doc:
The document where the new type is created.
name:
The name of new type.
Returns:
The newly created system-zone element type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
name is an empty string.
-or-
This name is already used by an existing system-zone element type in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2026

Autodesk.Revit.DB.Mechanical.SystemZoneElementType.CreateSketchBased(Autodesk.Revit.DB.Document,System.String)
Creates a new element type for sketch-based system-zone elements and adds it to the document.
doc:
The document where the new type is created.
name:
The name of new type.
Returns:
The newly created system-zone element type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
name is an empty string.
-or-
This name is already used by an existing system-zone element type in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2026

Autodesk.Revit.DB.Mechanical.SystemZoneElementType.AirChangesPerHour
The air changes per hour.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The value should be between [0.0,10000].
Since:
2026

Autodesk.Revit.DB.Mechanical.SystemZoneElementType.OutdoorAirPerArea
The outdoor air per area in unit feet per second.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The value should be between [0.0,166.66].
Since:
2026

Autodesk.Revit.DB.Mechanical.SystemZoneElementType.OutdoorAirPerPerson
The outdoor air in unit cubic feet per second per person.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The value should be between [0.0,166.66].
Since:
2026

Autodesk.Revit.DB.Mechanical.SystemZoneElementType.DehumidificationSetPoint
The humidification set point as a number between 0 and 1.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property:
Since:
2026

Autodesk.Revit.DB.Mechanical.SystemZoneElementType.HumidificationSetPoint
The humidification set point as a number between 0 and 1.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property:
Since:
2026

Autodesk.Revit.DB.Mechanical.SystemZoneElementType.UseDehumidificationSetPoint
Use the dehumidification set point.
Since:
2026

Autodesk.Revit.DB.Mechanical.SystemZoneElementType.UseHumidificationSetPoint
Use the humidification set point.
Since:
2026

Autodesk.Revit.DB.Mechanical.SystemZoneElementType.CoolingAirTemperature
The cooling air temperature in unit Kelvin (K).
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property:
Since:
2027

Autodesk.Revit.DB.Mechanical.SystemZoneElementType.HeatingAirTemperature
The heating air temperature in unit Kelvin (K).
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property:
Since:
2027

Autodesk.Revit.DB.Mechanical.SystemZoneElementType.CoolingSetPoint
The cooling temperature set point in unit Kelvin (K).
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property:
Since:
2026

Autodesk.Revit.DB.Mechanical.SystemZoneElementType.HeatingSetPoint
The heating temperature set point in unit Kelvin (K).
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property:
Since:
2026

Autodesk.Revit.DB.Mechanical.SystemZoneElementType.GeometricDefinition
The geometric definition for this element type.
Since:
2026

Autodesk.Revit.DB.Mechanical.SystemZoneElementType
Represents an element type for a system-zone element.
Since:
2026